# View View Position Id Property

Source: https://www.revitapidocs.com/2026/e6e03c46-d0f6-be1f-f677-a627fb4e742e.htm

---

| View View Position Id Property |
| --- |

The id of the view's saved position. Default is set to ElementId.InvalidElementId.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId ViewPositionId { get; set; }
```

```
Public Property ViewPositionId As ElementId
	Get
	Set
```

```
public:
property ElementId^ ViewPositionId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member ViewPositionId : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non\-optional argument was null |
| InvalidOperationException | When setting this property: |

See Also

#### Reference

View Class Autodesk.Revit.DB Namespace